# СОЗДАНИЕ ПЕРЕМЕННЫХ
# Создайте вектор под названием z и со значением 42
# Создайте вектор под названием var и с тем же значением

# Создайте вектор под названием name и запишите в него 2 значения: ваши имя и фамилия

# Создайте вектор под названием height и запишите в него свой рост в см
# Создайте вектор под названием age и запишите в него свой возраст

# Создайте список под название me, в который поместите ваши имя, фамилию, рост и возраст

# Логические выражения
# 1. Прочитайте выражения и попробуйте определить ответ. 
# Запустите и сравните с полученным ответом:

# Сравнение логических операторов
TRUE == FALSE

# Сравнение чисел
-6 * 14 != 17 - 101

# Сравнение строк символов
"useR" == "user"

# Сравнение логического оператора и числа
TRUE == 1

# 2.	Прочитайте выражения и попробуйте определить ответ. 
# Запустите и сравните:
  
# Сравнение чисел
-6 * 5 + 2 >= -10 + 1

# Сравнение строк символов
"raining" <= "raining dogs"

# Сравнение логических операторов
TRUE > FALSE

# 3.	Прочитайте выражения и попробуйте определить ответ.
# Запустите и сравните:
x <- 5
y <- 7
!(!(x < 4) & !!!(y > 12))

# ПАКЕТЫ

# 1.	Установите пакет ggplot2
# 2.	Запустите его

# ПОЛЕЗНЫЕ ФУНКЦИИ

# 1.	Найдите справку по функции sd() и ее аргументы

# 2.	Напечатайте в консоль "Slow down!"

# 3.	Рассортируйте вектор в убывающем порядке:
linkedin <- c(16, 9, 13, 5, 2, 17, 14)

# 4.	Найдите сумму модулей округленный чисел из переменной error
errors <- c(1.9, -2.6, 4.0, -9.5, -3.4, 7.3)

# 5.	Найдите среднее, медиану и стандартное отклонение
linkedin <- c(16, 9, 13, 5, 2, 17, 14)

# 6.	Повторите каждое число два раза
linkedin <- c(16, 9, 13, 5, 2, 17, 14)

# 7.	Пропишите в обратной последовательности
linkedin <- c(16, 9, 13, 5, 2, 17, 14)

### Дополнительно:
# Напишите функцию, которая содержит два аргумента: вектор и число. 
# Она должна считать сколько раз это число встречается в векторе.

# Напишите функцию, которая содержит один аргумента: вектор. 
# Она должна выводить в консоль: среднее и стандартное отклонение, а также медиану (по желанию).